Tekla Open API Reference for Tekla Structures 2025
BendSurface Constructor
Overload List
Name | Description
BendSurface(Arc, Double, Double)
 Initializes a new instance of the BendSurface class from a base arc, a height and a radius at the top. This is the recommended constructor if no intermediate points are desired along the lateral boundaries of the bend surface.
BendSurface(List<Point>, List<Point>, Line, Vector)
 Initializes a new instance of the BendSurface class from the cone lateral boundaries and the center line. This is the recommended constructor if fine grained control is desired over the lateral boundaries of the surface
BendSurface(Vector, Vector, List<Point>, List<Point>)
 Initializes a new instance of the BendSurface class with given parameters. The boundaries are defined by the lateral boundaries (i.e. the points on the sides of the curved part of the surface). The side boundaries are defined by the two first points and the two last points of the lateral boundaries.
BendSurface(Vector, Vector, LineSegment, LineSegment)
 Initializes a new instance of the BendSurface class with given parameters. The boundaries are defined by the side boundaries (i.e. generator lines of the surface).
Top
See Also
Reference
BendSurface Class
Tekla.Structures.Model Namespace